Revit 2024 API
BaseImportOptions.GetDefaultLengthUnit Method
 Get the default length unit used for importing unitless files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public ForgeTypeId GetDefaultLengthUnit()
Visual Basic
Public Function GetDefaultLengthUnit As ForgeTypeId
Visual C++
public:
ForgeTypeId^ GetDefaultLengthUnit()
See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace